#Generated by Fabric Compiler ( version 2022.2-SP6.4 <build 146967> ) at Fri Mar  7 14:12:09 2025

remove_design -verilog "D:/BaiduNetdiskDownload/fpga-demos/pcie_dma_test/pcie_dma_test/hdl/dram_pcie.v"
add_design "D:/BaiduNetdiskDownload/fpga-demos/pcie_dma_test/pcie_dma_test/hdl/pcie_dma_test.v"
remove_constraint  -logic -fdc "D:/BaiduNetdiskDownload/fpga-demos/pcie_dma_test/pcie_dma_test/constraints/dram_pcie.fdc"
add_constraint "D:/BaiduNetdiskDownload/fpga-demos/pcie_dma_test/pcie_dma_test/constraints/pcie_dma_test.fdc"
remove_fic "D:/BaiduNetdiskDownload/fpga-demos/pcie_dma_test/pcie_dma_test/synthesize/dram_pcie_syn.fic"
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
add_design D:/BaiduNetdiskDownload/fpga-demos/pcie_dma_test/pcie_dma_test/ipcore/pcie_test/pcie_test.idf
remove_design D:/BaiduNetdiskDownload/fpga-demos/pcie_dma_test/pcie_dma_test/ipcore/ip_pcie/ip_pcie.idf
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
remove_constraint  -logic -fdc "D:/BaiduNetdiskDownload/fpga-demos/pcie_dma_test/pcie_dma_test/constraints/pcie_dma_test.fdc"
add_constraint "D:/BaiduNetdiskDownload/fpga-demos/pcie_dma_test/pcie_dma_test/fdc/pcie_dma_test.fdc"
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pgr_uart2apb_top_32bit
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pgr_uart2apb_top_32bit
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
add_fic "D:/DMYWdownloadsoftware/PDS/project/project_bs/PCIe_LC/pcie_dma_test/synthesize/pcie_dma_test_syn.fic"
remove_fic -force"D:/DMYWdownloadsoftware/PDS/project/project_bs/PCIe_LC/pcie_dma_test/synthesize/pcie_dma_test_syn.fic"
add_fic "D:/DMYWdownloadsoftware/PDS/project/project_bs/PCIe_LC/pcie_dma_test/synthesize/pcie_dma_test_syn.fic"
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
add_design "D:/DMYWdownloadsoftware/PDS/project/project_bs/PCIe_IIc_LC/pcie_dma_test/my_code_file/IIc_text/ipcore/iic_pll/iic_pll.idf"
add_design "D:/DMYWdownloadsoftware/PDS/project/project_bs/PCIe_IIc_LC/pcie_dma_test/my_code_file/IIc_text/iic_slave_top.v"
add_design "D:/DMYWdownloadsoftware/PDS/project/project_bs/PCIe_IIc_LC/pcie_dma_test/my_code_file/IIc_text/i2cSlave.v"
add_design "D:/DMYWdownloadsoftware/PDS/project/project_bs/PCIe_IIc_LC/pcie_dma_test/my_code_file/IIc_text/i2cSlave_define.v"
add_design "D:/DMYWdownloadsoftware/PDS/project/project_bs/PCIe_IIc_LC/pcie_dma_test/my_code_file/IIc_text/registerInterface.v"
add_design "D:/DMYWdownloadsoftware/PDS/project/project_bs/PCIe_IIc_LC/pcie_dma_test/my_code_file/IIc_text/serialInterface.v"
add_design "D:/DMYWdownloadsoftware/PDS/project/project_bs/PCIe_IIc_LC/pcie_dma_test/my_code_file/IIc_text/timescale.v"
remove_design -force -verilog "D:/DMYWdownloadsoftware/PDS/project/project_bs/PCIe_IIc_LC/pcie_dma_test/my_code_file/IIc_text/iic_slave_top.v"
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
add_design "D:/DMYWdownloadsoftware/PDS/project/project_bs/PCIe_IIc_SXT_LC/pcie_dma_test/my_code_file/OV5640/ipcore/pll/pll.idf"
add_design "D:/DMYWdownloadsoftware/PDS/project/project_bs/PCIe_IIc_SXT_LC/pcie_dma_test/my_code_file/OV5640/cmos_8_16bit.v"
add_design "D:/DMYWdownloadsoftware/PDS/project/project_bs/PCIe_IIc_SXT_LC/pcie_dma_test/my_code_file/OV5640/i2c_com.v"
add_design "D:/DMYWdownloadsoftware/PDS/project/project_bs/PCIe_IIc_SXT_LC/pcie_dma_test/my_code_file/OV5640/power_on_delay.v"
add_design "D:/DMYWdownloadsoftware/PDS/project/project_bs/PCIe_IIc_SXT_LC/pcie_dma_test/my_code_file/OV5640/reg_config.v"
add_design D:/DMYWdownloadsoftware/PDS/project/project_bs/PCIe_IIc_SXT_LC/pcie_dma_test/ipcore/PLL/PLL.idf
remove_design D:/DMYWdownloadsoftware/PDS/project/project_bs/PCIe_IIc_SXT_LC/pcie_dma_test/my_code_file/OV5640/ipcore/pll/pll.idf
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
add_design "D:/DMYWdownloadsoftware/PDS/project/project_bs/PCIe_IIc_SXT_DDR_LC/pcie_dma_test/my_code_file/SXT/rgb565_to_rgb888.v"
add_design "D:/DMYWdownloadsoftware/PDS/project/project_bs/PCIe_IIc_SXT_DDR_LC/pcie_dma_test/my_code_file/DDR3/ip_core/ddr3/ddr3.idf"
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
dev_map 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
add_design "D:/DMYWdownloadsoftware/PDS/project/project_bs/PCIe_IIc_SXT_DDR_1_LC/pcie_dma_test/my_code_file/SXT/fifo_32to128.v"
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pgr_uart2apb_top_32bit
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
add_design D:/DMYWdownloadsoftware/PDS/project/project_bs/PCIe_IIc_SXT_DDR_3_LC_TP_2/pcie_dma_test/ipcore/SXT_FIFO/SXT_FIFO.idf
add_design D:/DMYWdownloadsoftware/PDS/project/project_bs/PCIe_IIc_SXT_DDR_3_LC_TP_2/pcie_dma_test/ipcore/SXT1_FIFO/SXT1_FIFO.idf
remove_design -force D:/DMYWdownloadsoftware/PDS/project/project_bs/PCIe_IIc_SXT_DDR_3_LC_TP_2/pcie_dma_test/ipcore/SXT_FIFO/SXT_FIFO.idf
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
remove_design -verilog "D:/DMYWdownloadsoftware/PDS/project/project_bs/PCIe_IIc_SXT_DDR_3_LC_TP_4/pcie_dma_test/my_code_file/SXT/fifo_32to128.v"
remove_design D:/DMYWdownloadsoftware/PDS/project/project_bs/PCIe_IIc_SXT_DDR_3_LC_TP_4/pcie_dma_test/my_code_file/IIc_text/ipcore/iic_pll/iic_pll.idf
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
add_design "E:/PDS_Verilog/FPGA-Video-Capture-main/FPGA-Video-Capture-main/board_3_oneboard_design/source/axi_m.v"
add_design "E:/PDS_Verilog/FPGA-Video-Capture-main/FPGA-Video-Capture-main/board_3_oneboard_design/source/axi_m_arbitration.v"
add_design "E:/PDS_Verilog/FPGA-Video-Capture-main/FPGA-Video-Capture-main/board_3_oneboard_design/source/rw_fifo_ctrl.v"
add_design "E:/PDS_Verilog/FPGA-Video-Capture-main/FPGA-Video-Capture-main/board_3_oneboard_design/ipcore/read_ddr_fifo/read_ddr_fifo.idf"
add_design "E:/PDS_Verilog/FPGA-Video-Capture-main/FPGA-Video-Capture-main/board_3_oneboard_design/ipcore/write_ddr_fifo/write_ddr_fifo.idf"
add_design "E:/PDS_Verilog/FPGA-Video-Capture-main/FPGA-Video-Capture-main/board_3_oneboard_design/source/eth_img_rec.v"
add_design "E:/PDS_Verilog/FPGA-Video-Capture-main/FPGA-Video-Capture-main/board_3_oneboard_design/source/gmii_to_rgmii.v"
add_design "E:/PDS_Verilog/FPGA-Video-Capture-main/FPGA-Video-Capture-main/board_3_oneboard_design/source/pcie_dma_ctrl.v"
add_design "E:/PDS_Verilog/FPGA-Video-Capture-main/FPGA-Video-Capture-main/board_3_oneboard_design/ipcore/eth_pkt_fifo/eth_pkt_fifo.idf"
add_design "E:/PDS_Verilog/FPGA-Video-Capture-main/FPGA-Video-Capture-main/board_3_oneboard_design/ipcore/hdmi_pcie_fifo/hdmi_pcie_fifo.idf"
remove_design -verilog "E:/PDS_Verilog/FPGA-Video-Capture-main/FPGA-Video-Capture-main/board_3_oneboard_design/source/gmii_to_rgmii.v"
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
add_design F:/rknn2/pcie_test/PCIe_IIc_SXT_DDR_3_LC_TP_4_2/pcie_dma_test/ipcore/write_ddr_fifo/write_ddr_fifo.idf
add_design F:/rknn2/pcie_test/PCIe_IIc_SXT_DDR_3_LC_TP_4_2/pcie_dma_test/ipcore/read_ddr_fifo/read_ddr_fifo.idf
remove_design -verilog "E:/PDS_Verilog/FPGA-Video-Capture-main/FPGA-Video-Capture-main/board_3_oneboard_design/source/axi_m_arbitration.v"
remove_design -verilog "E:/PDS_Verilog/FPGA-Video-Capture-main/FPGA-Video-Capture-main/board_3_oneboard_design/source/rw_fifo_ctrl.v"
remove_design E:/PDS_Verilog/FPGA-Video-Capture-main/FPGA-Video-Capture-main/board_3_oneboard_design/ipcore/write_ddr_fifo/write_ddr_fifo.idf
remove_design E:/PDS_Verilog/FPGA-Video-Capture-main/FPGA-Video-Capture-main/board_3_oneboard_design/ipcore/read_ddr_fifo/read_ddr_fifo.idf
remove_design F:/rknn2/pcie_test/PCIe_IIc_SXT_DDR_3_LC_TP_4_2/pcie_dma_test/ipcore/write_ddr_fifo/write_ddr_fifo.idf
remove_design F:/rknn2/pcie_test/PCIe_IIc_SXT_DDR_3_LC_TP_4_2/pcie_dma_test/ipcore/read_ddr_fifo/read_ddr_fifo.idf
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
